Tekla Open API Reference for Tekla Structures 2025
Vector Methods
The Vector type exposes the following members.
Methods
Name | Description
CompareTo
 Compares two points. To use binarysearch somekind of sorting should be used.
 (Inherited from Point.)
Cross(Vector)
 Returns a new cross product vector of the current vector and the given vector.
Cross(Vector, Vector)
 Returns a new cross product vector of the given two vectors.
Dot(Vector)
 Returns a dot product of the current vector and the given vector.
Dot(Vector, Vector)
 Returns a dot product of the given two vectors.
Equals
 Returns true if the current object and the given object are equal.
 (Inherited from Point.)
GetAngleBetween
 Gets the angle (in radians) between the current vector and the given vector.
GetHashCode
 Returns a hash code for the point. Notice, in extremely rare cases, you might not get the same hash code for two points even though they are considered equal! This should, however, happen only in extremely rare cases!
 (Inherited from Point.)
GetLength
 Gets the length (magnitude) of a vector.
GetNormal
 Returns a new normalized equivalent of the current vector.
Normalize()
 Normalizes the vector using the length 1.0 (the length of a unit vector).
Normalize(Double)
 Normalizes the vector using the given length.
ToString
 Formats the 3D vector into a string with fixed decimals, in the following way: "(X, Y, Z)".
 (Overrides Point.ToString().)
Translate
 Translates the point using the given vector.
 (Inherited from Point.)
Zero
 Zeros all the members of the point.
 (Inherited from Point.)
Top
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace